    package com.richmedia.ecofit

    import com.richmedia.ecofit.Adapter.EcoData

    val data = EcoData(
        "Зеленый салат с курицей и авокадо",
        "Ингредиенты:\n" +
                "Зеленые листовые овощи (руккола, шпинат, салат и т.д.)\n" +
                "Куриное филе, запеченное или отваренное\n" +
                "Половинка авокадо\n" +
                "Помидоры черри\n" +
                "Оливковое масло\n" +
                "Лимонный сок\n" +
                "Специи по вкусу\n" +
                "Смешайте все ингредиенты и полейте оливковым маслом и лимонным соком.",
        R.drawable.a
    )

    val data1 = EcoData(
        "Тушеные овощи с креветками", "Ингредиенты:\n" +
                "Креветки\n" +
                "Брокколи\n" +
                "Морковь\n" +
                "Цукини\n" +
                "Лук\n" +
                "Чеснок\n" +
                "Оливковое масло\n" +
                "Пряности (по вкусу)\n" +
                "Тушите овощи и креветки на сковороде, приправьте специями и подавайте.", R.drawable.b
    )

    val data3 = EcoData(
        "Омлет с овощами", "Ингредиенты:\n" +
                "Яйца\n" +
                "Помидоры\n" +
                "Перец\n" +
                "Грибы\n" +
                "Лук\n" +
                "Зелень (кинза, петрушка и т.д.)\n" +
                "Оливковое масло\n" +
                "Подготовьте омлет, добавив нарезанные овощи, и приправьте зеленью", R.drawable.c
    )

    val data4 = EcoData(
        "Запеченый лосось с овощами",
        "Ингредиенты:\n" +
                "Филе лосося\n" +
                "Брокколи\n" +
                "Морковь\n" +
                "Цукини\n" +
                "Чеснок\n" +
                "Лимон\n" +
                "Оливковое масло\n" +
                "Пряности (по вкусу)\n" +
                "Запекайте лосось вместе с овощами, смазанными оливковым маслом, лимонным соком и специями.",
        R.drawable.e
    )

    val data5 = EcoData("Гречневая каша с овощами", "Ингредиенты:\n" +
            "Гречневая крупа\n" +
            "Брокколи\n" +
            "Морковь\n" +
            "Лук\n" +
            "Чеснок\n" +
            "Оливковое масло\n" +
            "Пряности (по вкусу)\n" +
            "Сварите гречку, а затем обжарьте овощи на сковороде с добавлением оливкового масла и специй. Подавайте овощи на гречневой каше.", R.drawable.ee)

    val data6 = EcoData("Тушеная капуста с индейкой", "Ингредиенты:\n" +
            "Филе индейки\n" +
            "Белокочанная капуста\n" +
            "Лук\n" +
            "Чеснок\n" +
            "Оливковое масло\n" +
            "Пряности (по вкусу)\n" +
            "Тушите капусту и нарезанное мясо индейки вместе на сковороде с добавлением оливкового масла и специй.",R.drawable.rrr)

    val data7 = EcoData("Запеченные куриные крылышки с овощами", "Ингредиенты:\n" +
            "Куриные крылышки\n" +
            "Брокколи\n" +
            "Морковь\n" +
            "Лук\n" +
            "Чеснок\n" +
            "Оливковое масло\n" +
            "Пряности (по вкусу)\n" +
            "Запекайте куриные крылышки вместе с овощами, смазанными оливковым маслом и пряностями.", R.drawable.w)


    val data8 = EcoData("Фруктовый салат с ягодами и орехами", "Ингредиенты:\n" +
            "Яблоки\n" +
            "Груши\n" +
            "Клубника\n" +
            "Голубика\n" +
            "Грецкие орехи или миндаль\n" +
            "Мед (по вкусу)\n" +
            "Сок лимона\n" +
            "Нарежьте фрукты и смешайте с ягодами и орехами. Полейте соком лимона и добавьте мед, если хотите усилить сладость.", R.drawable.eee)

        ////

    val data9 = EcoData("Курица с овощами на гриле", "Ингредиенты:\n" +
            "Куриное филе (подготовленное)\n" +
            "Перец (красный, желтый, зеленый)\n" +
            "Кабачки\n" +
            "Шпинат\n" +
            "Чеснок (измельченный)\n" +
            "Оливковое масло\n" +
            "Лимонный сок\n" +
            "Соль, перец (по вкусу)\n" +
            "Овощи порежьте крупными кусками, добавьте курицу и оливковое масло. Подготовьте гриль и обжаривайте овощи и курицу до золотистой корочки. После приготовления посыпьте лимонным соком и добавьте специи по вкусу. Подавайте с шпинатом сверху.",
            R.drawable.rrr)

    val data10 = EcoData("Зеленый салат с курицей и авокадо", "Ингредиенты:\n" +
            "Зеленые листовые овощи (руккола, шпинат, салат и т.д.)\n" +
            "Куриное филе, запеченное или отваренное\n" +
            "Половинка авокадо\n" +
            "Помидоры черри\n" +
            "Оливковое масло\n" +
            "Лимонный сок\n" +
            "Специи по вкусу\n" +
            "Смешайте все ингредиенты и полейте оливковым маслом и лимонным соком.", R.drawable.zzz)

    val data11 = EcoData("Тушеные овощи с креветками", "Ингредиенты:\n" +
            "Креветки\n" +
            "Брокколи\n" +
            "Морковь\n" +
            "Цукини\n" +
            "Лук\n" +
            "Чеснок\n" +
            "Оливковое масло\n" +
            "Пряности (по вкусу)\n" +
            "Тушите овощи и креветки на сковороде, приправьте специями и подавайте.", R.drawable.xxx)

    val data12 = EcoData("Киноа с овощами и фасолью", "Ингредиенты:\n" +
            "Киноа\n" +
            "Болгарский перец\n" +
            "Красный лук\n" +
            "Фасоль (черная, красная или любая другая)\n" +
            "Чеснок\n" +
            "Оливковое масло\n" +
            "Лимонный сок\n" +
            "Пряности (по вкусу)\n" +
            "Приготовьте киноа, обжарьте овощи и фасоль на сковороде, смешайте все ингредиенты вместе, приправьте лимонным соком и специями.",
        R.drawable.ccc)

    val data13 = EcoData("Омлет с овощами", "Ингредиенты:\n" +
            "Яйца\n" +
            "Помидоры\n" +
            "Перец\n" +
            "Грибы\n" +
            "Лук\n" +
            "Зелень (кинза, петрушка и т.д.)\n" +
            "Оливковое масло\n" +
            "Подготовьте омлет, добавив нарезанные овощи, и приправьте зеленью.", R.drawable.vvv)

    val data14 = EcoData("Запеченый лосось с овощами", "Ингредиенты:\n" +
            "Филе лосося\n" +
            "Брокколи\n" +
            "Морковь\n" +
            "Цукини\n" +
            "Чеснок\n" +
            "Лимон\n" +
            "Оливковое масло\n" +
            "Пряности (по вкусу)\n" +
            "Запекайте лосось вместе с овощами, смазанными оливковым маслом, лимонным соком и специями.",
        R.drawable.bbb)

    val data15 = EcoData("Гречневая каша с овощами", "Ингредиенты:\n" +
            "Гречневая крупа\n" +
            "Брокколи\n" +
            "Морковь\n" +
            "Лук\n" +
            "Чеснок\n" +
            "Оливковое масло\n" +
            "Пряности (по вкусу)\n" +
            "Сварите гречку, а затем обжарьте овощи на сковороде с добавлением оливкового масла и специй. Подавайте овощи на гречневой каше.",
        R.drawable.nnn)

    val data16 = EcoData("Салат из капусты и яблок", "Ингредиенты:\n" +
            "Красная капуста\n" +
            "Зеленое яблоко\n" +
            "Орехи (грецкие, кедровые или любые другие)\n" +
            "Оливковое масло\n" +
            "Яблочный уксус\n" +
            "Мед или сироп из клена (по вкусу)\n" +
            "Нарежьте капусту и яблоки, добавьте орехи. Затем смешайте с оливковым маслом, яблочным уксусом и медом или сиропом из клена для приготовления заправки.",
        R.drawable.mmm)

    val data17 = EcoData("FastDood", "asdasdsadasd", R.drawable.w)
    val data18 = EcoData("FastDood", "asdasdsadasd", R.drawable.w)
    val data19 = EcoData("FastDood", "asdasdsadasd", R.drawable.w)
